emacs/config.org
#+PROPERTY: header-args  :tangle yes
#+PROPERTY: header-args+ :file ~/.emacs.d/elisp/config.el
#+PROPERTY: header-args+ :mkdirp yes


* Timing emacs startup time
  If emacs is taking a while to load, this may help diagnosing which package is causing the slowdown.

  Stolen from https://www.emacswiki.org/emacs/OptimizingEmacsStartup

#+BEGIN_SRC emacs-lisp
  (defvar *emacs-load-start* (current-time))
  (defun anarcat/time-to-ms (time)
    (+ (* (+ (* (car time) (expt 2 16)) (car (cdr time))) 1000000) (car (cdr (cdr time)))))
  (defun anarcat/display-timing ()
    (message ".emacs loaded in %fms" (/ (- (anarcat/time-to-ms (current-time)) (anarcat/time-to-ms *emacs-load-start*)) 1000000.0)))
  (add-hook 'after-init-hook 'anarcat/display-timing t)
#+END_SRC

* Unmanaged packages
 - rjsx-mode
   The latest release of rjsx-mode predates https://github.com/felipeochoa/rjsx-mode/issues/67, and is interfering with how I like to use jsx.

* Usability Changes
** Suppress startup messages
   We don't need to see the fancy emacs screen every time.

#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-echo-area-message "llaw")
#+END_SRC

** Shorten prompts
   Now we can use ~y~ or ~n~ instead of ~yes~ or ~no~ when answering prompts.

#+BEGIN_SRC emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

* Editing
** Parenthesis Handling

#+BEGIN_SRC emacs-lisp
  (setq show-paren-mode t)
  (setq show-paren-delay 0)
  (setq show-paren-highlight-openparen t)
  (setq show-paren-when-point-in-periphery t)
  (setq show-paren-when-point-inside-paren t)

#+END_SRC

** Completion

#+BEGIN_SRC emacs-lisp
(use-package company
  :ensure t
  :delight
  :config
  ;; (add-hook 'after-init-hook 'global-company-mode))
  (setq company-idle-delay 0.1)
  (add-hook 'python-mode-hook 'company-mode)
  )

#+END_SRC


** Misc
#+BEGIN_SRC emacs-lisp
  (setq truncate-lines t)
#+END_SRC

* Theme Settings

#+BEGIN_SRC emacs-lisp
  (use-package zenburn-theme
    :ensure t)

  (use-package color-theme-sanityinc-tomorrow
    :ensure t
    :config
    (load-theme 'sanityinc-tomorrow-night t)
    )
#+END_SRC


* Misc
** Emacs Server Mode

   This allows us to use an existing instance of emacs to edit things,
   i.e. git commit messages.

   We probably need to have a check to see if there's an existing
   instance running...

#+BEGIN_SRC emacs-lisp
  (server-start)
#+END_SRC
